mentatpsi/Microchip/Graphics/Primitive Layer/Configs/HWP_MEB_PIC32_ETH_SK_8PMP.h
        Another macro that may affect the way the x and y measurement 
        are the following:
        TOUCHSCREEN_RESISTIVE_PRESS_THRESHOLD - determines how light the 
            touch on the screen. The smaller the  value the lighter the 
            touch. Valid range of values: 0-0x03ff
        TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR - this is the scale
            factor used to calculate the touch coefficients. The equation 
            to calculate the scale factor is:
               (1 << TOUCHSCREEN_RESISTIVE_CALIBRATION_SCALE_FACTOR).
            Valid values: 0 - 15 (most resistive touch screens will work 
                                  in the range of 5 - 7)

	*********************************************************************/
	/* ----------------------------------------- */
	#if defined (GFX_PICTAIL_V3)              || \
		  defined (GFX_PICTAIL_V3E)             || \
          defined (GFX_PICTAIL_LCC)             || \
		  defined (PIC24FJ256DA210_DEV_BOARD)   || \
	      defined (MEB_BOARD) 
	/* ----------------------------------------- */
	/*********************************************************************
	* Touch Screen Non-Volatile Memory Storage Macros
	*********************************************************************/
	/* ----------------------------------------- */
	#if defined (USE_MCHP25LC256)  
	/* ----------------------------------------- */
		// for  GFX_PICTAIL_V1 or GFX_PICTAIL_V2
		// Addresses for calibration and version values in EEPROM on Explorer 16
        #define ADDRESS_RESISTIVE_TOUCH_VERSION (unsigned)0x7FFE

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)0)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&MCHP25LC256WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&MCHP25LC256ReadWord)
   	

	/* ----------------------------------------- */
    #elif defined (USE_SST25VF016) || defined (USE_M25P80)
	/* ----------------------------------------- */
		// Addresses for calibration and version values in SPI Flash on Graphics PICtail 3 & PIC24FJ256DA210 Development Board.
		// Or Addresses for calibration and version values in Parallel Flash on PIC24FJ256DA210 Development Board.
        #define ADDRESS_RESISTIVE_TOUCH_VERSION	(unsigned long)0xFFFFFFFE

        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)&SST25SectorErase)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&SST25WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&SST25ReadWord)

	/* ----------------------------------------- */
	#elif defined (USE_SST39LF400)
	/* ----------------------------------------- */
		// for  PIC24FJ256DA210 Dev Board 
		#define ADDRESS_RESISTIVE_TOUCH_VERSION	(unsigned long)0x0003FFFE
	    
        // define the functions to call for the non-volatile memory
        // check out touch screen module for definitions of the following function pointers
        // used: NVM_READ_FUNC, NVM_WRITE_FUNC & NVM_SECTORERASE_FUNC
		#define NVMSectorErase					((NVM_SECTORERASE_FUNC)&SST39LF400SectorErase)
    	#define NVMWrite 						((NVM_WRITE_FUNC)&SST39LF400WriteWord)
    	#define NVMRead 						((NVM_READ_FUNC)&SST39LF400ReadWord)

	/* ----------------------------------------- */
	#else	// when no non-volatile memory is used
	/* ----------------------------------------- */
		#warning "Non-Volatile Memory addresses is not set for touch screen calibration"

		#define ADDRESS_RESISTIVE_TOUCH_VERSION	0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFA   0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFB   0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFC   0
	    #define ADDRESS_RESISTIVE_TOUCH_COEFD   0

		#define NVMSectorErase					((void *)0)
    	#define NVMWrite 						((void *)0)
    	#define NVMRead 						((void *)0)

    #endif    
#endif

    // define the SPI channel to be used
    #if defined (GFX_PICTAIL_V3E)
        #define AR1020_SPI_CHANNEL 2
    #elif defined (PIC24FJ256DA210_DEV_BOARD)    
        #ifdef PIC24FJ256DA210_DEV_BOARD_ENC624J600
            #define AR1020_SPI_CHANNEL 1
        #else
            #define AR1020_SPI_CHANNEL 2
        #endif
    #endif	


    #ifdef __PIC32MX__
    #define TouchScreenChipEnable()     LATGCLR = _LATG_LATG9_MASK
    #define TouchScreenChipDisable()    LATGSET = _LATG_LATG9_MASK
    #define TouchScreenChipDirection()  TRISGCLR = _TRISG_TRISG9_MASK
    #else
    #ifdef __PIC24FJ256DA210__
    #define TouchScreenChipEnable()     LATAbits.LATA1 = 0
    #define TouchScreenChipDisable()    LATAbits.LATA1 = 1
    #define TouchScreenChipDirection()  TRISAbits.TRISA1 = 0
    #else
    #define TouchScreenChipEnable()     LATGbits.LATG9 = 0
    #define TouchScreenChipDisable()    LATGbits.LATG9 = 1
    #define TouchScreenChipDirection()  TRISGbits.TRISG9 = 0
    #endif
    #endif

    #ifdef __PIC24FJ256GB210__
    #define TouchScreenPacketReady()        (PORTCbits.RC3 == 1)
    #define TouchScreenConfigPacketReady()  {     TRISCbits.TRISC3 = 1; LATCbits.LATC3 = 0;    }
    #elif defined (__PIC24FJ256DA210__)
    #define TouchScreenPacketReady()        (PORTCbits.RC4 == 1)
    #define TouchScreenConfigPacketReady()  {     TRISCbits.TRISC4 = 1; LATCbits.LATC4 = 0;    }
    #else
    #define TouchScreenPacketReady()        (PORTAbits.RA14 == 1)
    #define TouchScreenConfigPacketReady()  {     TRISAbits.TRISA14 = 1; LATAbits.LATA14 = 0;    }
    #endif

    #define AR1020_SCK_TRIS  TRISGbits.TRISG6
    #define AR1020_SDO_TRIS  TRISGbits.TRISG8
    #define AR1020_SDI_TRIS  TRISGbits.TRISG7
    #define AR1020_SDI_ANS   ANSGbits.ANSG7

#endif // defined (USE_TOUCHSCREEN_AR1020)


/*********************************************************************
* HARDWARE PROFILE FOR THE SPI FLASH MEMORY
*********************************************************************/
/*
	These are the hardware settings for the SPI peripherals used.
*/

#if defined (USE_MCHP25LC256) 

    /*********************************************************************
	* Serial Bus SPI EEPROM (MCHP 25LC256) On Explorer 16  
	*********************************************************************/
	// When using Explorer 16, the on board EEPROM SPI (25LC256) is present 
	// so we define the chip select signal used. This is needed even 
	// if the memory is not used. Set to de-asserted state to avoid conflicts
	// when not used. That is why the EXPLORER_16 check is also needed.
	// see...#if defined (USE_MCHP25LC256) || defined (EXPLORER_16)

    /* Define all the SPI channels that will be used here.
       These will be used to determine how the SPI Driver (drv_spi)
       will be compiled.
    */
    // Chip Select signal 
    #if (MCHP25LC256_SPI_CHANNEL == 1)
        #define SPI_CHANNEL_1_ENABLE
    #elif (MCHP25LC256_SPI_CHANNEL == 2)
        #define SPI_CHANNEL_2_ENABLE
    #elif (MCHP25LC256_SPI_CHANNEL == 3)
        #define SPI_CHANNEL_3_ENABLE
    #elif (MCHP25LC256_SPI_CHANNEL == 4)
        #define SPI_CHANNEL_4_ENABLE
    #endif

    // Clock, SDO and SDI signals
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
        #define MCHP25LC256_SCK_TRIS TRISCbits.TRISC2
        #define MCHP25LC256_SDO_TRIS TRISCbits.TRISC0
        #define MCHP25LC256_SDI_TRIS TRISCbits.TRISC1
    #else
	    #define MCHP25LC256_SCK_TRIS TRISGbits.TRISG6
	    #define MCHP25LC256_SDO_TRIS TRISGbits.TRISG8
	    #define MCHP25LC256_SDI_TRIS TRISGbits.TRISG7
    #endif    

#endif // #if defined (USE_MCHP25LC256)

    // The MCHP25LC256 chip select signal, even if not used must be
    // driven to high so it does not interfere with other SPI peripherals
    // that uses the same SPI signals. 
    
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
            #define MCHP25LC256_CS_TRIS  TRISAbits.TRISA0
            #define MCHP25LC256_CS_LAT   LATAbits.LATA0
        #elif defined(__PIC24FJ256GB110__)
			// This PIM has RD12 rerouted to RG0
            #define MCHP25LC256_CS_TRIS  TRISGbits.TRISG0
            #define MCHP25LC256_CS_LAT   LATGbits.LATG0
        #else
            #define MCHP25LC256_CS_TRIS  TRISDbits.TRISD12
            #define MCHP25LC256_CS_LAT   LATDbits.LATD12
        #endif

#if defined (USE_SST25VF016) 

	/*********************************************************************
	* SPI Flash Memory on GFX_PICTIAL_V3, GFX_PICTAIL_V3e, 
	* PIC24FJ256DA210 Development Board and MEB_BOARD
	*********************************************************************/
	// Set up the signals used to communicate to the SPI Flash device 

    // define the SPI channel to be used
      #if defined (GFX_PICTAIL_LCC)
        #define SST25_SPI_CHANNEL 1
      #elif defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E)
        #define SST25_SPI_CHANNEL 2
    #elif defined (PIC24FJ256DA210_DEV_BOARD)    
            #if defined(CFG_INCLUDE_DA210_BRD_ENC624) || defined(CFG_INCLUDE_DA210_BRD_ENC28) || defined(PIC24FJ256DA210_DEV_BOARD_ENC624J600)
            #define SST25_SPI_CHANNEL 1
        #else
            #define SST25_SPI_CHANNEL 2
        #endif
    #elif defined (MEB_BOARD)
        // this is dependent on the Starter Kit used
    	#if defined (PIC32_GP_SK) || defined (PIC32_USB_SK) || defined (dsPIC33E_SK) || defined (PIC24E_SK)
            #define SST25_SPI_CHANNEL 2
    	#elif defined (PIC32_ETH_SK)
            #define SST25_SPI_CHANNEL 4
    	#else
    		#error "Please define the starter kit that you are using"
    	#endif
    #endif	

    /* Define all the SPI channels that will be used here.
       These will be used to determine how the SPI Driver (drv_spi)
       will be compiled.
    */
    #if (SST25_SPI_CHANNEL == 1)
        #define SPI_CHANNEL_1_ENABLE
    #elif (SST25_SPI_CHANNEL == 2)
        #define SPI_CHANNEL_2_ENABLE
    #elif (SST25_SPI_CHANNEL == 3)
        #define SPI_CHANNEL_3_ENABLE
    #elif (SST25_SPI_CHANNEL == 4)
        #define SPI_CHANNEL_4_ENABLE
    #endif


    // Chip Select, SCLK, SDI and SDO signals used 
    #if defined (GFX_PICTAIL_V3) || defined (GFX_PICTAIL_V3E) || defined(GFX_PICTAIL_LCC)
        #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)
            #define SST25_CS_TRIS   TRISAbits.TRISA8
            #define SST25_CS_LAT    LATAbits.LATA8
            
            #define SST25_SCK_TRIS  TRISCbits.TRISC2
            #define SST25_SDO_TRIS  TRISCbits.TRISC0
            #define SST25_SDI_TRIS  TRISCbits.TRISC1
            
        #else
            #define SST25_CS_TRIS   TRISDbits.TRISD1
            #define SST25_CS_LAT    LATDbits.LATD1
            
            #define SST25_SCK_TRIS  TRISGbits.TRISG6
            #define SST25_SDO_TRIS  TRISGbits.TRISG8
            #define SST25_SDI_TRIS  TRISGbits.TRISG7
            
            #if defined (__dsPIC33E__) || defined(__PIC24E__)
			#define SST25_SCK_LAT  	LATGbits.LATG6
	    	#define SST25_SCK_ANS   ANSELGbits.ANSG6
	    	#define SST25_SDO_ANS   ANSELGbits.ANSG8
	    	#define SST25_SDO_LAT  	LATGbits.LATG8
	        #define SST25_SDI_LAT  	LATGbits.LATG7  
	        #define SST25_SDI_ANS   ANSELGbits.ANSG7       		
    		#else            
    			#define SST25_SDI_ANS   ANSGbits.ANSG7
    		#endif
        #endif
    #elif defined (PIC24FJ256DA210_DEV_BOARD)
    
        #define SST25_CS_TRIS   TRISAbits.TRISA14
        #define SST25_CS_LAT    LATAbits.LATA14
        
        #define SST25_SCK_TRIS  TRISDbits.TRISD8
        #define SST25_SDO_TRIS  TRISBbits.TRISB1
        #define SST25_SDI_TRIS  TRISBbits.TRISB0
        
        #define SST25_SDI_ANS   ANSBbits.ANSB0
        #define SST25_SDO_ANS   ANSBbits.ANSB1
            
    #elif defined (MEB_BOARD)
        
        // this is dependent on the Starter Kit used
	    // define the CPLD SPI selection and chip select     
	    #if defined(__dsPIC33E__) || defined(__PIC24E__)
	    	#if (SST25_SPI_CHANNEL == 2)
		    	#define SPI_FLASH_CHANNEL   CPLD_SPI2
		    	#define SST25_CS_TRIS   TRISGbits.TRISG9    // SPI slave select, Input or Output selection.
				#define SST25_CS_LAT    LATGbits.LATG9      // SPI slave select I/O pin latch.
				#define SST25_CS_ANS    ANSELGbits.ANSG9    // SPI slave select I/O pin analog/digital selection.
				
				#define SST25_SCK_TRIS   TRISGbits.TRISG6    // SPI clock , Input or Output selection.
				#define SST25_SCK_LAT    LATGbits.LATG6      // SPI clock, I/O pin latch.
				#define SST25_SCK_ANS    ANSELGbits.ANSG6    // SPI clock , I/O pin analog/digital selection.
				
				#define SST25_SDO_TRIS   TRISGbits.TRISG8    // SPI data out , Input or Output selection.
				#define SST25_SDO_LAT    LATGbits.LATG8      // SPI data out,  I/O pin latch.
				#define SST25_SDO_ANS    ANSELGbits.ANSG8    // SPI data out, I/O pin analog/digital selection.
				
				#define SST25_SDI_TRIS  TRISGbits.TRISG7	 // SPI data in , Input or Output selection.
				#define SST25_SDI_LAT    LATGbits.LATG7      // SPI data in,  I/O pin latch.
				#define SST25_SDI_ANS    ANSELGbits.ANSG7    // SPI data in, I/O pin analog/digital selection.
			#else
				#error "When using dsPIC33E or PIC24E starter kits, MultiMedia Expansion Board (MEB) needs to use SPI channel 2 (SST25_SPI_CHANNEL == 2) for for SPI Flash"
			#endif
			
		#else
	    	#if (SST25_SPI_CHANNEL == 2)
		    	#define SST25_CS_TRIS       TRISGbits.TRISG9
			    #define SST25_CS_LAT        LATGbits.LATG9
	    		#define SPI_FLASH_CHANNEL   CPLD_SPI2
		    #elif (SST25_SPI_CHANNEL == 3)
			    #define SST25_CS_TRIS       TRISGbits.TRISG9
			    #define SST25_CS_LAT        LATGbits.LATG9
			    #define SPI_FLASH_CHANNEL   CPLD_SPI2A
	    	#elif (SST25_SPI_CHANNEL == 4)
	    		#define SST25_CS_TRIS       TRISFbits.TRISF12
	    		#define SST25_CS_LAT        LATFbits.LATF12
	    		#define SPI_FLASH_CHANNEL   CPLD_SPI3A
	    	#else
				#error "MultiMedia Expansion Board (MEB) needs to use SPI channels 2,3 or 4 (SST25_SPI_CHANNEL == 2, 3 or 4) for for SPI Flash"
	    	#endif
	    #endif

    #endif

    #define SPIFlashConfigurePins() {                           \
                                            SST25_SDO_ANS  = ANSEL_DIGITAL; \
                                            SST25_SDI_ANS  = ANSEL_DIGITAL; \
                                            SST25_CS_LAT   = 1; \
                                            SST25_CS_TRIS  = 0; \
                                            SST25_SCK_TRIS = 0; \
                                            SST25_SDO_TRIS = 0; \
                                            SST25_SDI_TRIS = 1; \
                                    }        
    
#endif // #if defined (USE_SST25VF016)


#if defined (USE_M25P80) 

	/*********************************************************************
	* SPI Flash Memory on MIKRO_BOARD
	*********************************************************************/
	// Set up the signals used to communicate to the SPI Flash device 

    // define the SPI channel to be used
    #if defined (MIKRO_BOARD)
		#if defined (__PIC24FJ256GB110__)
		    #define SST25_SPI_CHANNEL 2
        #endif
    #endif

    /* Define all the SPI channels that will be used here.
       These will be used to determine how the SPI Driver (drv_spi)
       will be compiled.
    */
    #if (SST25_SPI_CHANNEL == 1)
        #define SPI_CHANNEL_1_ENABLE
    #elif (SST25_SPI_CHANNEL == 2)
        #define SPI_CHANNEL_2_ENABLE
    #elif (SST25_SPI_CHANNEL == 3)
        #define SPI_CHANNEL_3_ENABLE
    #elif (SST25_SPI_CHANNEL == 4)
        #define SPI_CHANNEL_4_ENABLE
    #endif
	
